Tekla.Structures.Drawing.DotPrintColor
Output color mode.

Tekla.Structures.Drawing.DotPrintColor.Color
Color mode.

Tekla.Structures.Drawing.DotPrintColor.BlackAndWhite
Black and white mode.

Tekla.Structures.Drawing.DotPrintColor.GreyScale
Grey scale mode.